{
  "name": "Corey Lawrence",
  "contact": {
    "linkedin": "https://www.linkedin.com/in/corey-m-lawrence/",
    "github": "https://github.com/CoreyMLawrence/",
    "portfolio": "https://coreylawrence.me/",
    "email": "cmlawrence445@gmail.com",
    "phone": "(828) 773-2391"
  },
  "location": "Winston-Salem, NC",
  "timezone": "America/New_York (US Eastern)",
  "preferred_contact": "Any (no preference)",
  "Years coding": "10+",
  "Years in marketing": "8+",
  "Years in AI": "3+",
  "education": [
    {
      "degree": "Bachelor of Science",
      "major": "Computer Science",
      "institution": "High Point University",
      "location": "High Point, NC",
      "honors": "Graduated cum laude"
    }
  ],
  "marketing_summary": {
    "overview": "8+ years of progressive marketing and product management experience at Highland International, with advancement from Marketing Specialist to Marketing Manager to Head of Marketing. Owned multiple product lines from research to launch, built campaigns across print and digital, and drove measurable growth in traffic, leads, and revenue.",
    "key_achievements": [
      "Directed a website redesign that, along with SEO and paid campaigns, grew online revenue from $50K to $250K annually.",
      "Tripled monthly site visitors (2,000 to 6,000+) through SEO, content optimization, and improved site structure.",
      "Increased organic search visibility by 300%, outranking national competitors such as Sherwin-Williams.",
      "Ran targeted Google Ads campaigns that doubled qualified leads.",
      "Owned multiple product launches (StoveMaster1200, 200QD, QuickDry45), overseeing everything from market research and label design to web promotion and sales enablement.",
      "Produced product labels, brochures, mailers, and collateral to establish consistent branding.",
      "Coordinated with sales and distributors to align marketing strategies with customer targeting."
    ],
    "metrics": {
      "organic_traffic_growth": "300% increase",
      "monthly_visitors": "2,000 to 6,000+",
      "online_revenue": "$50K to $250K annually",
      "qualified_leads": "Doubled through campaigns"
    }
  },
  "featured_projects": [
    {
      "name": "Comfort Airlines",
      "subtitle": "Airline Simulator",
      "technologies": ["Python", "JavaScript", "HTML5", "CSS3"],
      "github_url": "https://github.com/CoreyMLawrence/Comfort-Airlines",
      "description": "A comprehensive airline management simulator that uses advanced algorithms to maximize profit in air scheduling operations. Features an intuitive user interface that makes complex data analysis accessible, allowing users to navigate ticketing systems, scheduling operations, and financial management effortlessly.",
      "key_features": [
        "Advanced profit optimization algorithms for airline scheduling",
        "Comprehensive ticketing and reservation management system",
        "Real-time financial operations tracking and reporting",
        "User-friendly interface that simplifies complex airline data",
        "Multi-faceted airline operations simulation including crew, aircraft, and route management"
      ],
      "technical_highlights": [
        "Algorithm design for complex scheduling optimization",
        "Data visualization for airline operations analytics",
        "Full-stack implementation with Python backend and JavaScript frontend"
      ]
    },
    {
      "name": "Music Player PWA",
      "subtitle": "Progressive Web App",
      "technologies": ["JavaScript", "HTML5", "CSS3", "PWA", "Service Workers"],
      "live_url": "https://coreylawrencemusic.duckdns.org",
      "description": "A sophisticated Progressive Web App music player that offers efficient audio playbook with dynamic song management capabilities. Features intelligent audio preloading based on network connectivity, offline functionality, and seamless integration with device media controls.",
      "key_features": [
        "Offline capability - works without internet after initial load",
        "Cross-platform installation on iOS and Android devices",
        "Intelligent audio preloading based on network conditions",
        "Integration with Media Session API for native device controls",
        "Dynamic playlist management and audio library organization",
        "Responsive design optimized for both mobile and desktop experiences"
      ],
      "technical_highlights": [
        "Advanced JavaScript for audio management and buffering",
        "Service Worker implementation for offline functionality",
        "PWA architecture following modern web standards",
        "Media Session API integration for system-level audio controls",
        "Performance optimization for various network conditions"
      ]
    },
    {
      "name": "DevolveAI",
      "subtitle": "AI-Powered Decompiler",
      "technologies": ["Python", "Google Gemini AI", "JavaScript", "PHP"],
      "description": "An innovative AI-powered tool that transforms compiled executables into readable, understandable source code through a simple web interface. Makes reverse engineering accessible to developers at all skill levels by eliminating the need for complex software installations and extensive training.",
      "key_features": [
        "AI-powered decompilation of executable files into readable code",
        "Web-based interface accessible from any browser",
        "Refine feature for code language conversion and comment addition",
        "Beginner-friendly approach to reverse engineering",
        "Support for multiple programming languages in output",
        "Customizable code formatting and documentation generation"
      ],
      "technical_highlights": [
        "Integration with Google Gemini AI for intelligent code analysis",
        "Multi-language backend supporting Python and PHP",
        "Advanced file processing and executable analysis",
        "Real-time AI processing with user-friendly feedback",
        "Cross-platform web deployment for universal accessibility"
      ]
    },
    {
      "name": "AdventureAI",
      "subtitle": "AI-Powered Adventure Game",
      "technologies": ["JavaScript", "Google Gemini AI", "HTML5", "CSS3"],
      "live_url": "https://adventureai.duckdns.org/",
      "description": "An engaging choose-your-own-adventure game powered by AI that creates dynamic, personalized storytelling experiences. Features vibrant visuals, responsive design, and intelligent narrative generation that ensures each playthrough offers a unique adventure with compelling story branches.",
      "key_features": [
        "Dynamic AI-generated storytelling with unique narratives each session",
        "12 different adventure settings to shape narrative direction",
        "Shared gameplay database allowing users to explore others' adventures",
        "Fully responsive design optimized for both mobile and desktop",
        "Humorous and engaging content with rich visual presentation",
        "Real-time story adaptation based on player choices"
      ],
      "technical_highlights": [
        "Advanced AI integration for dynamic content generation",
        "Real-time story branching and narrative management",
        "Database architecture for shared user experiences",
        "Responsive web design with mobile-first approach",
        "Performance optimization for real-time AI interactions"
      ]
    }
  ],
  "career": [
    {
      "title": "Head of Marketing",
      "company": "Highland International, LLC",
      "location": "Boone, NC",
      "start_date": "2017-01",
      "end_date": "2020-05",
      "summary": "Owned product lifecycles, directed digital campaigns, and led a major web transformation that significantly boosted traffic and revenue.",
      "key_responsibilities": [
        "Owned multiple products across lifecycle, from ideation to sales.",
        "Directed a full web redesign with SEO and paid ad strategy, increasing online revenue by 400%.",
        "Designed product labels, packaging, brochures, and digital campaigns.",
        "Tripled organic traffic and outranked national competitors.",
        "Aligned marketing with sales strategies to grow market presence."
      ]
    },
    {
      "title": "Marketing Manager",
      "company": "Highland International, LLC",
      "location": "Boone, NC",
      "start_date": "2014-08",
      "end_date": "2016-12",
      "summary": "Managed campaigns across several product lines, refined targeting strategies, and improved branding.",
      "key_responsibilities": [
        "Executed Google Ads campaigns that doubled qualified leads.",
        "Oversaw packaging redesigns and collateral updates for brand consistency.",
        "Coordinated multi-channel marketing campaigns."
      ]
    },
    {
      "title": "Marketing Specialist",
      "company": "Highland International, LLC",
      "location": "Boone, NC",
      "start_date": "2012-10",
      "end_date": "2014-07",
      "summary": "Supported product launches with content, collateral, and campaign execution.",
      "key_responsibilities": [
        "Maintained website content and implemented keyword-driven updates.",
        "Produced product photography, print collateral, and marketing emails.",
        "Contributed to early product rollouts with research and promotion efforts."
      ]
    },
    {
      "title": "UI/UX Engineer",
      "company": "Phonelo AI",
      "location": "Remote",
      "start_date": "2024-05",
      "end_date": "2025-01",
      "summary": "Focused on front-end architecture, accessibility, and user experience for AI-powered transcription tools.",
      "key_responsibilities": [
        "Developed a responsive React-based UI for an AI transcription tool, integrating real-time audio syncing and transcript playback.",
        "Implemented accessibility standards (WCAG) to ensure usability across devices and audiences.",
        "Created interactive transitions, animations, and real-time state management across components.",
        "Worked with product, backend, and design teams to translate business requirements into user-friendly features.",
        "Optimized performance and responsiveness for mobile and desktop."
      ],
      "skills_used": [
        "React.js",
        "JavaScript",
        "TypeScript",
        "WCAG Accessibility",
        "Responsive Design",
        "UI Animation",
        "Cross-functional Collaboration"
      ]
    },
    {
      "title": "Founder | Independent Consultant",
      "company": "Catalon Consulting",
      "location": "Winston-Salem, NC",
      "start_date": "2025-01",
      "end_date": "Present",
      "summary": "Provides AI consulting and custom web solutions to help businesses streamline operations and enhance digital presence.",
      "key_responsibilities": [
        "Developed tailored AI-powered solutions to automate workflows, cut costs, and improve efficiency for small to mid-sized businesses.",
        "Designed and deployed custom websites with integrated content management systems.",
        "Worked directly with business owners to translate operational needs into functional, easy-to-use digital tools."
      ],
      "skills_used": [
        "AI Tools Integration",
        "Custom CMS Development",
        "JavaScript",
        "Client Consulting",
        "Business Process Automation"
      ]
    },
    {
      "title": "Full-Stack Developer",
      "company": "Inceed (Contract)",
      "location": "Remote",
      "start_date": "2025-03",
      "end_date": "Present",
      "summary": "Leads the full rebuild and deployment of a real estate development company's web platform, from architecture to front-end experience.",
      "key_responsibilities": [
        "Rebuilt Ashton Gray's website from scratch using Eleventy, Sanity CMS, and modular design principles.",
        "Hand-coded responsive front-end with HTML, CSS, JavaScript, and GSAP animations.",
        "Connected Sanity CMS content to dynamic Nunjucks templates for maintainable rendering.",
        "Developed Node-based scripts for CMS data fetching, image caching, and automated build triggers.",
        "Set up GitHub Actions for CI/CD deployment tied to content updates.",
        "Optimized SEO, caching, and image handling to improve page speed and search rankings.",
        "Collaborated with stakeholders to ensure tools and features align with business goals."
      ],
      "skills_used": [
        "Eleventy",
        "Sanity CMS",
        "HTML5",
        "CSS3",
        "JavaScript",
        "GSAP",
        "Nunjucks",
        "Node.js",
        "GitHub Actions",
        "SEO Optimization"
      ],
      "proud_of": "I'm especially proud of this Ashton Gray project because it's been a full-circle kind of challenge. It let me merge my marketing background—like crafting a strong brand story and user flow—with my design and technical skills. It's been the biggest technical challenge I've taken on, spanning backend, frontend, hosting, automated builds, and CMS integration. It pulls together all the areas I enjoy working in."
    }
  ],
  "skills_overview": {
    "web_development": [
      "AI Integration",
      "Web Design",
      "JavaScript",
      "Dynamic Animations",
      "Node.js",
      "Storytelling",
      "Eleventy",
      "Nunjucks"
    ],
    "cms_platforms": ["WordPress", "Sanity"],
    "design_tools": ["Adobe Photoshop", "Adobe Illustrator", "InDesign"],
    "marketing": [
      "Product Lifecycle Management",
      "SEO Strategy",
      "Google Ads Campaigns",
      "Content Marketing",
      "Conversion Optimization",
      "Analytics Tracking",
      "Email Campaigns",
      "Brand Development"
    ],
    "soft_skills": [
      "Cross-Functional Collaboration",
      "Clear Communication",
      "Problem-Solving",
      "Stakeholder Alignment",
      "Project Management"
    ]
  },
  "learning_and_growth": {
    "industry_trends": "I stay up to date by following AI and web dev news closely and testing new tools as soon as they come out. Recently, I've been experimenting with in-browser AI models like Xenova/Mistral to explore lighter, faster user-facing integrations."
  },
  "dream_project": {
    "description": "A personal dream project would be an AI-driven storytelling platform for kids. Users could pick a themed world and become characters in interactive stories. Over time it could scale into longer tales with visuals and voice, making storytelling more playful and personal."
  },
  "dream_collaborator": {
    "choice": "Alan Turing",
    "reason": "Turing laid the foundation for modern computing. It would be incredible to show him how far things have come in programming and AI, and to learn from how he might approach today's challenges."
  },
  "professional_traits": {
    "work_ethic": "Corey approaches work with a high level of ownership and accountability, treating every project as if it were his own brand. He is detail-oriented but understands how to prioritize and deliver on time in fast-paced environments.",
    "collaboration_style": "Easy to work with, receptive to feedback, and proactive in offering solutions. Known for building trust with colleagues by combining clear communication with follow-through.",
    "problem_solving": "Thrives in identifying root causes quickly, whether in technical systems or process workflows, and implementing practical, sustainable solutions.",
    "adaptability": "Comfortable stepping into ongoing projects, rapidly learning existing systems, and improving them without disrupting momentum.",
    "innovation": "Regularly introduces new tools, methods, and design improvements that enhance efficiency and elevate user experience.",
    "mission_alignment": "Values-driven professional who seeks out work that makes a tangible, positive impact, ensuring projects align with both user needs and organizational goals.",
    "reputation": "Respected for being steady under pressure, delivering high-quality work, and fostering an environment of trust, clarity, and mutual respect."
  }
}
